# ConfusingPadByElementsInMainModel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..ConfusingPadByElementsInMainModel Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
A pad in a design option cannot be hosted by topography in the Main Model [--if you continue it will not be added to the design option set].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ConfusingPadByElementsInMainModel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConfusingPadByElementsInMainModel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ConfusingPadByElementsInMainModel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace